pages/reference/markup/rainer-konigs-org-mode-summaries.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="description" content="The short summaries from Rainer Konig's videos.">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Rainer Konig's org-mode summaries | Shiny Penny</title>
<link href="/assets/css/bootstrap.min.css" rel="stylesheet" type="text/css">
<link href="/assets/css/rst.css" rel="stylesheet" type="text/css">
<link href="/assets/css/code.css" rel="stylesheet" type="text/css">
<link href="/assets/css/colorbox.css" rel="stylesheet" type="text/css">
<link href="/assets/css/theme.css" rel="stylesheet" type="text/css">
<link href="/assets/css/custom.css" rel="stylesheet" type="text/css">
<link href="/assets/css/ipython.min.css" rel="stylesheet" type="text/css">
<link href="/assets/css/nikola_ipython.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="/rss.xml">
<link rel="alternate" type="application/atom+xml" title="Atom" href="/index.atom">
<link rel="canonical" href="http://www.shinypenny.org/pages/reference/markup/rainer-konigs-org-mode-summaries.html">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Rodney Price">
<meta property="og:site_name" content="Shiny Penny">
<meta property="og:title" content="Rainer Konig's org-mode summaries">
<meta property="og:url" content="http://www.shinypenny.org/pages/reference/markup/rainer-konigs-org-mode-summaries.html">
<meta property="og:description" content="The short summaries from Rainer Konig's videos.">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-05-12T19:49:22-06:00">
<meta property="article:tag" content="emacs">
<meta property="article:tag" content="reference">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="http://www.shinypenny.org/">

                <span id="blog-title">Shiny Penny</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="/pages/about/index.html">About</a>
            </li>
<li class="dropdown">
<a href="#" class="dropdown-toggle" data-toggle="dropdown" aria-haspopup="true" aria-expanded="false">Projects <b class="caret"></b></a>
            <ul class="dropdown-menu"><li>
<a href="/pages/projects/balloon/">High-altitude balloon</a>
            </li></ul>
</li>
<li class="dropdown">
<a href="#" class="dropdown-toggle" data-toggle="dropdown" aria-haspopup="true" aria-expanded="false">Reference <b class="caret"></b></a>
            <ul class="dropdown-menu">
<li>
<a href="/pages/reference/markup/">Markup</a>
                    </li>
<li>
<a href="/pages/reference/software/">Software</a>
                    </li>
<li>
<a href="/pages/reference/hardware/">Hardware</a>
            </li>
</ul>
</li>
<li>
<a href="http://github.com/rodprice">GitHub</a>
                </li>
<li>
<a href="/archive.html">Archive</a>
                </li>
<li>
<a href="/categories/">Tags</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="/pages/reference/markup/rainer-konigs-org-mode-summaries.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text storypage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="/pages/reference/markup/rainer-konigs-org-mode-summaries.html" class="u-url">Rainer Konig's org-mode summaries</a></h1>

        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <p>
The following are notes from Rainer Konig's videos.  I'll fill these
in as I view them.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Headlines and outline mode</h2>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Todo keywords</h2>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Schedule, deadlines, and agenda views</h2>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Repeating tasks</h2>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Checklists</h2>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Tags</h2>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Agenda view (advanced)</h2>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">Customized agenda views</h2>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">Drawers, logging, and quick notes</h2>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">Archiving</h2>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">Automatic logging of status changes</h2>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12">Splitting your system into several files</h2>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13">The first capture template(s)</h2>
</div>

<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14">The :PROPERTIES: drawer</h2>
</div>

<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15">Archiving to different files</h2>
</div>

<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16">Ordered tasks</h2>
</div>

<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17">Timers</h2>
</div>

<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18">Clocking (a.k.a. time tracking)</h2>
</div>

<div id="outline-container-sec-19" class="outline-2">
<h2 id="sec-19">Column view</h2>
</div>

<div id="outline-container-sec-20" class="outline-2">
<h2 id="sec-20">Effort estimates</h2>
</div>

<div id="outline-container-sec-21" class="outline-2">
<h2 id="sec-21">Linking (internal)</h2>
</div>

<div id="outline-container-sec-22" class="outline-2">
<h2 id="sec-22">Linking (external)</h2>
</div>

<div id="outline-container-sec-23" class="outline-2">
<h2 id="sec-23">Attachments</h2>
</div>

<div id="outline-container-sec-24" class="outline-2">
<h2 id="sec-24">Priorities</h2>
</div>

<div id="outline-container-sec-25" class="outline-2">
<h2 id="sec-25"><a href="https://www.youtube.com/watch?v=JHKrTsiz4JU&amp;index=25&amp;list=PLVtKhBrRV_ZkPnBtt_TD1Cs9PJlU0IIdE&amp;t=633s">Tables</a></h2>
<div class="outline-text-2" id="text-25">
<ul class="org-ul">
<li>
<b>Goal</b>: Organize reference material in tables
</li>
<li>
<b>Recipe</b>: Orgmode has a built-in table editor
<code>|</code> :: use to separate columns
<code>|- &lt;tab&gt;</code> :: insert a horizontal line
<code>alt-&lt;left&gt;</code> :: or <code>alt-&lt;right&gt;</code> Move column left or right
<code>alt-shift-&lt;left&gt;</code> :: delete column
<code>alt-shift-&lt;right&gt;</code> :: insert column left
<code>C-c -</code> :: insert a horizontal line
<code>#+constants:</code> :: define a constant
<code>#+tblfm:</code> ::
<ul class="org-ul">
<li>Columns referenced by number <code>$column</code>
</li>
<li>Rows referenced by number <code>$row</code>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-26" class="outline-2">
<h2 id="sec-26">Exporting</h2>
</div>

<div id="outline-container-sec-27" class="outline-2">
<h2 id="sec-27">Advanced exporting</h2>
</div>

<div id="outline-container-sec-28" class="outline-2">
<h2 id="sec-28">Publishing</h2>
</div>

<div id="outline-container-sec-29" class="outline-2">
<h2 id="sec-29">Dynamic blocks</h2>
</div>

<div id="outline-container-sec-30" class="outline-2">
<h2 id="sec-30">Tracking habits</h2>
</div>

<div id="outline-container-sec-31" class="outline-2">
<h2 id="sec-31">Bulk agenda items</h2>
</div>

<div id="outline-container-sec-32" class="outline-2">
<h2 id="sec-32">Presenting my system</h2>
</div>

<div id="outline-container-sec-33" class="outline-2">
<h2 id="sec-33">Google Calendar integration</h2>
</div>

<div id="outline-container-sec-34" class="outline-2">
<h2 id="sec-34">Source code in org-mode</h2>
</div>
    </div>
    

</article>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2017         <a href="mailto:rod@shinypenny.org">Rodney Price</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="/assets/js/jquery.min.js"></script><script src="/assets/js/bootstrap.min.js"></script><script src="/assets/js/moment-with-locales.min.js"></script><script src="/assets/js/fancydates.js"></script><script src="/assets/js/jquery.colorbox-min.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(2, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
